IDEA StatiCa Open Model
TypeLinePosition Enumeration
Compatible with IDEA StatiCa Beta 21.0 - beta
 type position line support
 Namespace: IdeaRS.OpenModel.Detail.Loading
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public enum TypeLinePosition
Public Enumeration TypeLinePosition
public enum class TypeLinePosition
Members
Member name | Value | Description
Point | 0 |  on point (0, 0) or selected point
OnWallEdge | 1 |  on wall edge
Polyline | 2 |  polyline
See Also
Reference
IdeaRS.OpenModel.Detail.Loading Namespace